playlist_api/app/controllers/ledgers_controller.rb

  def index
    @ledgers = Ledger.all
---
SELECT "ledgers".* FROM "ledgers"

  def create
    @ledger = Ledger.new(ledger_params)

    if @ledger.save
---
INSERT INTO "ledgers" ("playlist_id", "song_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["playlist_id", 1], ["song_id", 2], ["created_at", "2020-07-10 21:57:04.910036"], ["updated_at", "2020-07-10 21:57:04.910036"]]

    def set_ledger
      @ledger = Ledger.find(params[:id])
---
SELECT "ledgers".* FROM "ledgers" WHERE "ledgers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]