playlist_api/app/controllers/playlists_controller.rb

  def create
    @playlist = Playlist.new(playlist_params)

    if @playlist.save
---
INSERT INTO "playlists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "top 5"], ["created_at", "2020-07-10 05:20:50.464986"], ["updated_at", "2020-07-10 05:20:50.464986"]]

    def set_playlist
      @playlist = Playlist.find(params[:id])
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]