playlist_api/app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "artist_name", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test"], ["artist_name", "test"], ["url", "test"], ["created_at", "2020-07-10 19:34:47.680515"], ["updated_at", "2020-07-10 19:34:47.680515"]]